# Pandas series and dataframes  

Useful documentation: 

- [Getting started](https://pandas.pydata.org/pandas-docs/stable/getting_started/index.html) guide to pandas:
- [Comparison with other tools](https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/index.html) like Stata, R and SQL.  
- Pandas complete [user guide](https://pandas.pydata.org/pandas-docs/stable/user_guide/index.html):
    - [Indexing and Selecting Data](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing).
    - [Reshaping and pivot tables](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html).
    - [Merge, join and concatenate](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html).
    - [Group By:](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) split-apply-combine (see **`groupby`** , **`pivot_table`** and **`crosstab`**, see [this link](https://pbpython.com/pandas-crosstab.html) - ***MUITO BOM!***).
    - [Time series and date functionality](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html).
- Pandas objects:
    - [**Series**](https://pandas.pydata.org/pandas-docs/stable/reference/series.html).
    - [**DataFrame**](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html).
    - [**Index**](https://pandas.pydata.org/pandas-docs/stable/reference/indexing.html).




Here is a basic tenet to keep in mind: **data alignment is intrinsic**. The link between labels and data will not be broken unless done so explicitly by you.

### To study:

**subset a dataset**
```python
# Define a list of models that we want to review
models = ["toyota","nissan","mazda", "honda", "mitsubishi", "subaru", "volkswagen", "volvo"]

# Create a copy of the data with only the top 8 manufacturers
df = df_raw[df_raw.make.isin(models)].copy()
```

# Series  
Series are an array of data of the same type.  
Find documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/series.html).  

Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to call:

```python
s = pd.Series(data, index=index)
```

Here, data can be many different things:
- an ndarray or list
- a Python dict
- a scalar value (like 5)

**From ndarray**: If `data` is an ndarray, index must be the same length as `data`. If no index is passed, one will be created having values `[0, ..., len(data) - 1]`.  

**From dict**: When the `data` is a dict, and an index is not passed, the Series index will be ordered by the dictâ€™s insertion order. If an index is passed, the values in `data` corresponding to the labels in the index will be pulled out.  
A Series is also like a fixed-size dict in that you can get and set values by index label.

**From scalar**: If `data` is a scalar value, an index must be provided. The value will be repeated to match the length of index.

> **Note**: pandas supports non-unique index values. If an operation that does not support duplicate index values is attempted, an exception will be raised at that time.

## Vectorized operations and label alignment with Series  

Series acts very similarly to a ndarray, and is a valid argument to most NumPy functions. However, operations such as slicing will also slice the index.  
**A key difference between Series and ndarray is that operations between Series automatically align the data based on label**. Thus, you can write computations without giving consideration to whether the Series involved have the same labels. Thus, **the result of an operation between unaligned Series will have the union of the indexes involved**. If a label is not found in one Series or the other, the result will be marked as missing NaN. Being able to write code without doing any explicit data alignment grants immense freedom and flexibility in interactive data analysis and research.

In [1]:
import pandas as pd

In [2]:
s = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
s[1:] + s[:-1]

a    NaN
b    4.0
c    6.0
d    8.0
e    NaN
dtype: float64

#### Key points:

- Each series has only one data type (even if it is a more inclusive one, like object).
- A list of indexes might be used (it has to have the same dimension).
- It is possible to use dictionaries to create series.

We first define a panda series.

In [3]:
s1 = pd.Series([10, 3, 5, 1, 12])
print(s1)

0    10
1     3
2     5
3     1
4    12
dtype: int64

In [4]:
s2 = pd.Series(data=["Larry", "Bill", "Mark", "Steve"], 
               index=["Google", "Microsoft", "Facebook", "Apple"])
print(s2)

Google       Larry
Microsoft     Bill
Facebook      Mark
Apple        Steve
dtype: object

In [5]:
my_dict = {"Google": "Larry",
           "Microsoft": "Bill",
           "Facebook": "Mark",
           "Apple": "Steve"}

s3 = pd.Series(my_dict)
print(s3)

Google       Larry
Microsoft     Bill
Facebook      Mark
Apple        Steve
dtype: object

## Most useful Attributes

`Series.values` returns a numpy array of the values and `Series.index` returns the series' indexes.

In [6]:
s3.values

array(['Larry', 'Bill', 'Mark', 'Steve'], dtype=object)

In [7]:
s3.index

Index(['Google', 'Microsoft', 'Facebook', 'Apple'], dtype='object')

# Dataframe    
Find documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html).  

**DataFrame** is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects.  

Like Series, DataFrame accepts many different kinds of input:
- Dict of 1D ndarrays, lists, dicts, or Series
- 2-D numpy.ndarray
- Structured or record ndarray
- A Series
- Another DataFrame  

Along with the data, you can optionally pass **index** (row labels) and **columns** (column labels) as arguments. If you pass an index and/or columns, you are guaranteeing the index and/or columns of the resulting DataFrame (e.g., a dict of Series plus a specific index will discard all data not matching up to the passed index).  
The row and column labels can be accessed respectively by accessing the index and columns attributes: `df.index` and `df.columns`  

**From dict of Series or dicts**: The resulting index will be the union of the indexes of the various Series. If you pass an index and/or columns, you are guaranteeing the index and/or columns of the resulting DataFrame.  

**From dict of ndarrays / lists**: The ndarrays must all be the same length. If an index is passed, it must clearly also be the same length as the arrays.

## Column selection, addition, deletion  
You can treat a DataFrame semantically like a dict of like-indexed Series objects. Getting, setting, and deleting columns works with the same syntax as the analogous dict operations:

In [8]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
     'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [9]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [10]:
df['three'] = df['one'] * df['two']
df['flag'] = df['one'] > 2
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

When inserting a Series that does not have the same index as the DataFrame, it will be conformed to the DataFrameâ€™s index:

In [11]:
df['one_trunc'] = df['one'][:2]
df

   one  two  three   flag  one_trunc
a  1.0  1.0    1.0  False        1.0
b  2.0  2.0    4.0  False        2.0
c  3.0  3.0    9.0   True        NaN
d  NaN  4.0    NaN  False        NaN

Columns can be deleted or popped like with a dict:

In [12]:
del df['two']
three = df.pop('three')
df

   one   flag  one_trunc
a  1.0  False        1.0
b  2.0  False        2.0
c  3.0   True        NaN
d  NaN  False        NaN

The basics of indexing are as follows:

<table border="1" class="colwidths-given docutils">
<colgroup>
<col width="50%" />
<col width="33%" />
<col width="17%" />
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Operation</th>
<th class="head">Syntax</th>
<th class="head">Result</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>Select column</td>
<td><code class="docutils literal notranslate"><span class="pre">df[col]</span></code></td>
<td>Series</td>
</tr>
<tr class="row-odd"><td>Select row by label</td>
<td><code class="docutils literal notranslate"><span class="pre">df.loc[label]</span></code></td>
<td>Series</td>
</tr>
<tr class="row-even"><td>Select row by integer location</td>
<td><code class="docutils literal notranslate"><span class="pre">df.iloc[loc]</span></code></td>
<td>Series</td>
</tr>
<tr class="row-odd"><td>Slice rows</td>
<td><code class="docutils literal notranslate"><span class="pre">df[5:10]</span></code></td>
<td>DataFrame</td>
</tr>
<tr class="row-even"><td>Select rows by boolean vector</td>
<td><code class="docutils literal notranslate"><span class="pre">df[bool_vec]</span></code></td>
<td>DataFrame</td>
</tr>
</tbody>
</table>

In [13]:
df1 = pd.DataFrame([ [1, 2, 3, 7], [4.2, 6.1, 8.9, -4.1], ["a", "b", "c", "z"] ])
df1

     0    1    2    3
0    1    2    3    7
1  4.2  6.1  8.9 -4.1
2    a    b    c    z

In [14]:
df2 = pd.DataFrame([ [1, 2, 3, 7], [4.2, 6.1, 8.9, -4.1], ["a", "b", "c", "z"] ],
                   columns=["col_1", "col_2", "col_3", "col_4"])
df2

  col_1 col_2 col_3 col_4
0     1     2     3     7
1   4.2   6.1   8.9  -4.1
2     a     b     c     z

In [15]:
df3 = pd.DataFrame([ [1, 2, 3, 7], [4.2, 6.1, 8.9, -4.1], ["a", "b", "c", "z"] ],
                   columns=["col_1", "col_2", "col_3", "col_4"],
                   index=["row_1", "row_2", "row_3"])
df3

      col_1 col_2 col_3 col_4
row_1     1     2     3     7
row_2   4.2   6.1   8.9  -4.1
row_3     a     b     c     z

In [16]:
company = ["Google", "Microsoft", "Facebook", "Apple"]
founder_name = ["Larry", "Bill", "Mark", "Steve"]
founder_surname = ["Page", "Gates", "Zuckerberg", "Jobs"]

df4 = pd.DataFrame({'company': company,
                    'founder_name': founder_name,
                    'founder_surname': founder_surname})
df4

     company founder_name founder_surname
0     Google        Larry            Page
1  Microsoft         Bill           Gates
2   Facebook         Mark      Zuckerberg
3      Apple        Steve            Jobs

In [17]:
company = ["Google", "Microsoft", "Facebook", "Apple", "Oracle", "Netflix"]
founder_name = ["Larry", "Bill", "Mark", "Steve", "Larry", "Reed"]
founder_surname = ["Page", "Gates", "Zuckerberg", "Jobs", "Ellison", "Hastings"]
year_found = [1998, 1975, 2004, 1976, 1977, 1997]

series_company = pd.Series(data=company)
series_names = pd.Series(data=founder_name)
series_surnames = pd.Series(data=founder_surname)
series_year_found = pd.Series(data=year_found)

df = pd.DataFrame({'company': series_company,
                   'founder_name': series_names,
                   'founder_surname': series_surnames,
                   'year_founded': series_year_found})

df

     company founder_name founder_surname  year_founded
0     Google        Larry            Page          1998
1  Microsoft         Bill           Gates          1975
2   Facebook         Mark      Zuckerberg          2004
3      Apple        Steve            Jobs          1976
4     Oracle        Larry         Ellison          1977
5    Netflix         Reed        Hastings          1997

**Add new columns**

In [18]:
df["location"] = ["Mountain View", "Albuquerque", "Menlo Park", "Cupertino", "Santa Clara", "Scotts Valley"]
df["state"] = ["California", "New Mexico", "California", "California", "California", "California"]
df["number_employees"] = [73992, 124000, 20658, 123000, 138000, 5400]
df

,company,founder_name,founder_surname,year_founded,location,state,number_employees
0,Google,Larry,Page,1998,Mountain View,California,73992
1,Microsoft,Bill,Gates,1975,Albuquerque,New Mexico,124000
2,Facebook,Mark,Zuckerberg,2004,Menlo Park,California,20658
3,Apple,Steve,Jobs,1976,Cupertino,California,123000
4,Oracle,Larry,Ellison,1977,Santa Clara,California,138000
5,Netflix,Reed,Hastings,1997,Scotts Valley,California,5400

## Previewing a DataFrame

In [19]:
df.head(n=2)

,company,founder_name,founder_surname,year_founded,location,state,number_employees
0,Google,Larry,Page,1998,Mountain View,California,73992
1,Microsoft,Bill,Gates,1975,Albuquerque,New Mexico,124000

In [20]:
df.tail(n=2)

,company,founder_name,founder_surname,year_founded,location,state,number_employees
4,Oracle,Larry,Ellison,1977,Santa Clara,California,138000
5,Netflix,Reed,Hastings,1997,Scotts Valley,California,5400

In [21]:
df.count()

company             6
founder_name        6
founder_surname     6
year_founded        6
location            6
state               6
number_employees    6
dtype: int64

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   company           6 non-null      object
 1   founder_name      6 non-null      object
 2   founder_surname   6 non-null      object
 3   year_founded      6 non-null      int64
 4   location          6 non-null      object
 5   state             6 non-null      object
 6   number_employees  6 non-null      int64
dtypes: int64(2), object(5)
memory usage: 464.0+ bytes

In [23]:
df.describe()

       year_founded  number_employees
count      6.000000          6.000000
mean    1987.833333      80841.666667
std       13.197222      57039.422527
min     1975.000000       5400.000000
25%     1976.250000      33991.500000
50%     1987.000000      98496.000000
75%     1997.750000     123750.000000
max     2004.000000     138000.000000

In [24]:
df.shape

(6, 7)

In [25]:
# Read the data in file airbnb_rooms.csv into a pandas DataFrame and use column room_id as the DataFrame index.
df = pd.read_csv('datasets/airbnb_rooms.csv', index_col='room_id')


#### Key points:

- DataFrames may be seen as a tabular structure (named rows and columns).
- We can define the indexes and columns as we create the dataframe.
- It possible to take advantage of dictionaries and Series to create DataFrames.
- To add the new columns of data it is not necessary to create a new dataframe.